Running Terraform plan
An execution plan has been generated and is shown below.

Resource actions are indicated with the following symbols:

  + create



Terraform will perform the following actions:



  # netlify_site.main will be created

  + resource "netlify_site" "main" {

      + account_name  = (known after apply)

      + account_slug  = "creditas"

      + custom_domain = "home-carteiritas-frontend.stg.creditas.io"

      + deploy_url    = (known after apply)

      + id            = (known after apply)

      + name          = "home-carteiritas-frontend-staging"

    }



  # module.route53_record.aws_route53_record.route53_record will be created

  + resource "aws_route53_record" "route53_record" {

      + allow_overwrite = (known after apply)

      + fqdn            = (known after apply)

      + id              = (known after apply)

      + name            = "home-carteiritas-frontend.stg.creditas.io"

      + records         = [

          + "home-carteiritas-frontend-stg.netlify.com.",

        ]

      + ttl             = 300

      + type            = "CNAME"

      + zone_id         = "Z134L5U2F8FQIQ"

    }



Plan: 2 to add, 0 to change, 0 to destroy.



------------------------------------------------------------------------



This plan was saved to: terraform.tfplan



To perform exactly these actions, run the following command to apply:

    terraform apply "terraform.tfplan"


